2026.03.03.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2026.02.24.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2026.03.10.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of February 24 to March 03, 2026.

#+TOC: headlines 1


* Lwt.6.1.0, Lwt_ppx.6.1.0
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-lwt-6-1-0-lwt-ppx-6-1-0/17770/2

** Continuing this thread, Raphaël Proust announced


Lwt.6.1.1 has been released. It contains a fix to support build with OCaml.5.5. Thanks to @kit-ty-kate for the contribution.
      



* OCaml Platform Newsletter: November 2025 to January 2026
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ocaml-platform-newsletter-november-2025-to-january-2026/17845/1

** Sabine Schmaltz announced


Welcome to the seventeenth edition of the OCaml Platform newsletter!

In this November 2025 to January 2026 edition, we are excited to bring you the latest on the OCaml Platform, continuing our tradition of highlighting recent developments as seen in [[https://discuss.ocaml.org/tag/platform-newsletter][previous editions]]. To understand the direction we're headed, especially regarding development workflows and user experience improvements, check out our [[https://ocaml.org/docs/platform-roadmap][roadmap]].

You can [[https://www.linkedin.com/newsletters/ocaml-platform-newsletter-7305270694567661568/][subscribe to this newsletter on LinkedIn]]!

*Highlights:*

- *opam 2.5.0 Released*: Major release featuring incremental opam file loading for up to 70% faster ~opam update~, improved shell integration, and better macOS sandbox support
- *Relocatable OCaml Merged*: The final piece of the relocatable OCaml puzzle was merged in December, enabling opam to clone switches instead of recompiling them. This will be available in the first alpha release of OCaml 5.5
- *Dune 3.21.0*: Large release with dozens of fixes, improvements, and new features including OxCaml compiler support and copy-on-write file operations
- *Enhanced Editor Support*: OCaml-LSP 1.25.0 adds ~.mlx~ file support with formatting, diagnostics, and code actions, plus new custom requests
- *Merlin 5.6.1-504*: Performance optimizations, smarter signature help, and fixed completion for inlined record labels
- *opam-publish 2.7.1*: Fixes for GitHub API token permissions
- *dune-release 2.2.0*: Full compatibility with cmdliner 2.0.0
- *opam-repository Archival*: January 1, 2026 archival run removed 3,264 package versions to maintain repository sustainability

*Backstage OCaml:*

- [[https://ocaml.org/backstage/2025-11-05-how-the-opam-repository-works][OCaml Infrastructure: How the opam-repository Works]] (Nov 5, 2025)

*Stable Releases:*

- [[https://ocaml.org/changelog/2025-11-18-opam-publish-2.7.1][opam-publish 2.7.1]] (Nov 18, 2025)
- [[https://ocaml.org/changelog/2025-11-27-opam-2.5.0][opam 2.5.0]] (Nov 27, 2025)
- [[https://ocaml.org/changelog/2025-12-20-merlin-v5-6-1-504][Merlin 5.6.1-504]] (Dec 20, 2025)
- [[https://ocaml.org/changelog/2025-12-20-ocaml-lsp-1-25-0][OCaml-LSP 1.25.0]] (Dec 20, 2025)
- [[https://ocaml.org/changelog/2026-01-16-dune-3-21-0][Dune 3.21.0]] (Jan 16, 2026)
- [[https://ocaml.org/changelog/dune-release/2026-01-29-dune-release-2.2.0][dune-release 2.2.0]] (Jan 29, 2026)

*Unstable Releases:*

- [[https://ocaml.org/changelog/2025-11-20-opam-2-5-0-rc1][opam 2.5.0~rc1]] (Nov 20, 2025)
- [[https://ocaml.org/changelog/2025-11-10-opam-2-5-0-beta1][opam 2.5.0~beta1]] (Nov 10, 2025)

*** OCaml Compiler

**** Relocatable OCaml Merged

In December 2025, the final piece of the [[https://www.dra27.uk/blog/platform/2025/12/17/its-merged.html][Relocatable OCaml]] puzzle was merged, enabling opam to clone switches instead of recompiling them. This feature will be available in the first alpha release of OCaml 5.5.

*What Relocatable OCaml Enables:*

This feature allows the OCaml compiler and its associated tools to be moved to different filesystem locations after installation without breaking functionality. Key benefits include:

- Binary distributions that work regardless of installation path
- Improved flexibility for package managers organizing OCaml installations
- Bundling of specific OCaml versions by developer tools without path conflicts
- Simplified cross-platform distribution

The implementation is the culmination of work by David Allsopp, with review from Samuel Hym, Jonah Beckford, and others. See the [[https://discuss.ocaml.org/t/relocatable-ocaml/17253][announcement on Discuss]] and the [[https://github.com/ocaml/ocaml/pull/14243][merged PRs]] ([[https://github.com/ocaml/ocaml/pull/14244][#14244]], [[https://github.com/ocaml/ocaml/pull/14245][#14245]], [[https://github.com/ocaml/ocaml/pull/14246][#14246]], [[https://github.com/ocaml/ocaml/pull/14247][#14247]]) for technical details.

*** Build System

