2026.03.03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-03 Tue 14:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2026.02.24.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2026.03.10.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of February 24 to March 03, 2026.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">Lwt.6.1.0, Lwt_ppx.6.1.0</a></li>
<li><a href="#2">OCaml Platform Newsletter: November 2025 to January 2026</a></li>
<li><a href="#3">Announcing the first release of Alice, a radical OCaml build system</a></li>
<li><a href="#4">mnet, a new TCP/IP stack for unikernels in OCaml</a></li>
<li><a href="#5">Experiment: format-line</a></li>
<li><a href="#6">Caml in the Capital - Registrations Open!</a></li>
<li><a href="#7">Experimental tools for migrating from Lwt to Eio</a></li>
<li><a href="#8">First alpha release of OCaml 5.5.0</a></li>
<li><a href="#9">NotInriaCaml_Std.Wenv@0.1.0 - create Windows envs on macOS [dk0]</a></li>
<li><a href="#10">Running Real Docker Containers in OCaml Tests</a></li>
<li><a href="#11">I wrote a DSL for AI personalities in OCaml</a></li>
<li><a href="#12">Outreachy May 2026</a></li>
<li><a href="#org2b2f5f1">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">Lwt.6.1.0, Lwt_ppx.6.1.0</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-lwt-6-1-0-lwt-ppx-6-1-0/17770/2">https://discuss.ocaml.org/t/ann-lwt-6-1-0-lwt-ppx-6-1-0/17770/2</a>
</p>
</div>
<div id="outline-container-org1abc93d" class="outline-3">
<h3 id="org1abc93d">Continuing this thread, Raphaël Proust announced</h3>
<div class="outline-text-3" id="text-org1abc93d">
<p>
Lwt.6.1.1 has been released. It contains a fix to support build with OCaml.5.5. Thanks to @kit-ty-kate for the contribution.
</p>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">OCaml Platform Newsletter: November 2025 to January 2026</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-platform-newsletter-november-2025-to-january-2026/17845/1">https://discuss.ocaml.org/t/ocaml-platform-newsletter-november-2025-to-january-2026/17845/1</a>
</p>
</div>
<div id="outline-container-org0598b11" class="outline-3">
<h3 id="org0598b11">Sabine Schmaltz announced</h3>
<div class="outline-text-3" id="text-org0598b11">
<p>
Welcome to the seventeenth edition of the OCaml Platform newsletter!
</p>

<p>
In this November 2025 to January 2026 edition, we are excited to bring you the latest on the OCaml Platform, continuing our tradition of highlighting recent developments as seen in <a href="https://discuss.ocaml.org/tag/platform-newsletter">previous editions</a>. To understand the direction we're headed, especially regarding development workflows and user experience improvements, check out our <a href="https://ocaml.org/docs/platform-roadmap">roadmap</a>.
</p>

<p>
You can <a href="https://www.linkedin.com/newsletters/ocaml-platform-newsletter-7305270694567661568/">subscribe to this newsletter on LinkedIn</a>!
</p>

<p>
<b>Highlights:</b>
</p>

<ul class="org-ul">
<li><b>opam 2.5.0 Released</b>: Major release featuring incremental opam file loading for up to 70% faster <code>opam update</code>, improved shell integration, and better macOS sandbox support</li>
<li><b>Relocatable OCaml Merged</b>: The final piece of the relocatable OCaml puzzle was merged in December, enabling opam to clone switches instead of recompiling them. This will be available in the first alpha release of OCaml 5.5</li>
<li><b>Dune 3.21.0</b>: Large release with dozens of fixes, improvements, and new features including OxCaml compiler support and copy-on-write file operations</li>
<li><b>Enhanced Editor Support</b>: OCaml-LSP 1.25.0 adds <code>.mlx</code> file support with formatting, diagnostics, and code actions, plus new custom requests</li>
<li><b>Merlin 5.6.1-504</b>: Performance optimizations, smarter signature help, and fixed completion for inlined record labels</li>
<li><b>opam-publish 2.7.1</b>: Fixes for GitHub API token permissions</li>
<li><b>dune-release 2.2.0</b>: Full compatibility with cmdliner 2.0.0</li>
<li><b>opam-repository Archival</b>: January 1, 2026 archival run removed 3,264 package versions to maintain repository sustainability</li>
</ul>

<p>
<b>Backstage OCaml:</b>
</p>

<ul class="org-ul">
<li><a href="https://ocaml.org/backstage/2025-11-05-how-the-opam-repository-works">OCaml Infrastructure: How the opam-repository Works</a> (Nov 5, 2025)</li>
</ul>

<p>
<b>Stable Releases:</b>
</p>

<ul class="org-ul">
<li><a href="https://ocaml.org/changelog/2025-11-18-opam-publish-2.7.1">opam-publish 2.7.1</a> (Nov 18, 2025)</li>
<li><a href="https://ocaml.org/changelog/2025-11-27-opam-2.5.0">opam 2.5.0</a> (Nov 27, 2025)</li>
<li><a href="https://ocaml.org/changelog/2025-12-20-merlin-v5-6-1-504">Merlin 5.6.1-504</a> (Dec 20, 2025)</li>
<li><a href="https://ocaml.org/changelog/2025-12-20-ocaml-lsp-1-25-0">OCaml-LSP 1.25.0</a> (Dec 20, 2025)</li>
<li><a href="https://ocaml.org/changelog/2026-01-16-dune-3-21-0">Dune 3.21.0</a> (Jan 16, 2026)</li>
<li><a href="https://ocaml.org/changelog/dune-release/2026-01-29-dune-release-2.2.0">dune-release 2.2.0</a> (Jan 29, 2026)</li>
</ul>

<p>
<b>Unstable Releases:</b>
</p>

<ul class="org-ul">
<li><a href="https://ocaml.org/changelog/2025-11-20-opam-2-5-0-rc1">opam 2.5.0~rc1</a> (Nov 20, 2025)</li>
<li><a href="https://ocaml.org/changelog/2025-11-10-opam-2-5-0-beta1">opam 2.5.0~beta1</a> (Nov 10, 2025)</li>
</ul>
</div>
<div id="outline-container-orgc4e9c25" class="outline-4">
<h4 id="orgc4e9c25">OCaml Compiler</h4>
<div class="outline-text-4" id="text-orgc4e9c25">
</div>
<ul class="org-ul">
<li><a id="org48d8650"></a>Relocatable OCaml Merged<br />
<div class="outline-text-5" id="text-org48d8650">
<p>
In December 2025, the final piece of the <a href="https://www.dra27.uk/blog/platform/2025/12/17/its-merged.html">Relocatable OCaml</a> puzzle was merged, enabling opam to clone switches instead of recompiling them. This feature will be available in the first alpha release of OCaml 5.5.
</p>

<p>
<b>What Relocatable OCaml Enables:</b>
</p>

<p>
This feature allows the OCaml compiler and its associated tools to be moved to different filesystem locations after installation without breaking functionality. Key benefits include:
</p>

<ul class="org-ul">
<li>Binary distributions that work regardless of installation path</li>
<li>Improved flexibility for package managers organizing OCaml installations</li>
<li>Bundling of specific OCaml versions by developer tools without path conflicts</li>
<li>Simplified cross-platform distribution</li>
</ul>

<p>
The implementation is the culmination of work by David Allsopp, with review from Samuel Hym, Jonah Beckford, and others. See the <a href="https://discuss.ocaml.org/t/relocatable-ocaml/17253">announcement on Discuss</a> and the <a href="https://github.com/ocaml/ocaml/pull/14243">merged PRs</a> (<a href="https://github.com/ocaml/ocaml/pull/14244">#14244</a>, <a href="https://github.com/ocaml/ocaml/pull/14245">#14245</a>, <a href="https://github.com/ocaml/ocaml/pull/14246">#14246</a>, <a href="https://github.com/ocaml/ocaml/pull/14247">#14247</a>) for technical details.
</p>
</div>
</li>
</ul>
</div>
