2026.03.03.html
<div id="outline-container-org85c0a7d" class="outline-4">
<h4 id="org85c0a7d">Build System</h4>
<div class="outline-text-4" id="text-org85c0a7d">
</div>
<ul class="org-ul">
<li><a id="org20cdda4"></a>Dune<br />
<div class="outline-text-5" id="text-org20cdda4">
<p>
<a href="https://ocaml.org/changelog/2026-01-16-dune-3-21-0">Dune 3.21.0</a> (January 16, 2026) is a large release including dozens of fixes, improvements, and additions from many contributors.
</p>

<p>
<b>Notable Additions:</b>
</p>

<ul class="org-ul">
<li>(Experimental): <code>library_parameter</code> stanza for the OxCaml compiler</li>
<li>Copy-on-write (COW) when copying files on supporting filesystems (Btrfs, ZFS, XFS) under Linux</li>
<li>Support for Tangled ATproto-based code repositories</li>
<li>New <code>(dir ..)</code> field on packages to filter stanzas with <code>--only-packages</code></li>
<li><code>dune promotion show</code> command to preview corrected files</li>
<li>New <code>(lang rocq)</code> build mode for Rocq 9.0 and later</li>
<li>Support for instantiating OxCaml parameterised libraries</li>
<li><code>dune describe tests</code> to list tests in the workspace</li>
<li>Horizontal scrolling in TUI</li>
<li>Support for expanding variables in <code>(promote (into ..))</code></li>
</ul>

<p>
<b>Notable Fixes:</b>
</p>

<ul class="org-ul">
<li>Fixed <code>include_subdirs qualified</code> picking the furthest module instead of the closest</li>
<li>Improved error messages for invalid version formats with non-ASCII characters</li>
<li>Fixed crash when running <code>dune build @check</code> on libraries with virtual modules</li>
<li>Allow <code>$ dune init</code> to work on absolute paths</li>
<li>Stop hiding the <code>root_module</code> from the include path</li>
</ul>

<p>
For the complete list of changes, see the <a href="https://github.com/ocaml/dune/releases/tag/3.21.0">full release on GitHub</a>.
</p>

<p>
<b>Dune Maintained by</b>: Rudi Grinberg (@rgrinberg, Jane Street), Nicolás Ojeda Bär (@nojb, LexiFi), Marek Kubica (@Leonidas-from-XIV, Tarides), Ali Caglayan (@Alizter, Tarides), Stephen Sherratt (@gridbugs, Tarides), Antonio Nuno Monteiro (@anmonteiro), Sudha Parimala (@Sudha247, Tarides), Ambre Suhamy (@ElectreAAS, Tarides), Puneeth Chaganti (@punchagan, Tarides)
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org1814aef" class="outline-4">
<h4 id="org1814aef">Package Management</h4>
<div class="outline-text-4" id="text-org1814aef">
</div>
<ul class="org-ul">
<li><a id="org8fc79a5"></a>opam<br />
<div class="outline-text-5" id="text-org8fc79a5">
<p>
<a href="https://ocaml.org/changelog/2025-11-27-opam-2.5.0">opam 2.5.0</a> (November 27, 2025) is a major release with significant performance and usability improvements.
</p>

<p>
<b>Key Features:</b>
</p>

<ul class="org-ul">
<li><b>Massive speedup for <code>opam update</code></b>: Thanks to @arozovyk, opam update now loads opam files incrementally, only parsing files that have changed since the last update. For typical small diffs, this means operations that took seconds now complete in milliseconds</li>
<li><b>Improved shell integration</b>: Fixed issues where parts of a previous environment were kept in the current environment, causing various problems</li>
<li><b>Changed default shell integration file</b>: Now writes to <code>.bashrc</code> instead of <code>.profile</code> when bash is detected, preventing infinite loop issues</li>
<li><b>AppArmor profile</b>: The install script now installs an appropriate apparmor profile on systems configured with apparmor (enabled by default on Ubuntu)</li>
<li><b>macOS sandbox improvements</b>: Allow writing to <code>/var/folders/</code> and <code>/var/db/mds/</code> directories as required by some macOS core tools</li>
</ul>

<p>
<b>Build Changes:</b>
</p>

<ul class="org-ul">
<li><b>Ecosystem cmdliner 2.0.0 compatibility</b>: opam no longer depends on <code>cmdliner</code>, removing a key blocker that prevented cmdliner 1.x and 2.0.0 from being co-installable. This change enables ecosystem-wide migration to cmdliner 2.0.0</li>
<li>OCaml 5.5 (trunk) support when using dune's dev profile</li>
<li>The release archive (<code>opam-full-*.tar.gz</code>) is now reproducible</li>
<li>OpenBSD binary is now a full static binary</li>
</ul>

<p>
For more details, see the <a href="https://opam.ocaml.org/blog/opam-2-5-0/">official opam 2.5.0 announcement blog</a> and <a href="https://github.com/ocaml/opam/releases/tag/2.5.0">full release notes on GitHub</a>.
</p>

<p>
<b>opam Maintained by</b>: Raja Boujbel (@rjbou, OCamlPro), Kate Deplaix (@kit-ty-kate, Ahrefs), David Allsopp (@dra27, Tarides)
</p>
</div>
</li>
<li><a id="org2f25e7b"></a>opam-publish<br />
<div class="outline-text-5" id="text-org2f25e7b">
<p>
<a href="https://ocaml.org/changelog/2025-11-18-opam-publish-2.7.1">opam-publish 2.7.1</a> (November 18, 2025) fixes bugs related to the GitHub API token permissions introduced in version 2.7.0.
</p>

<p>
<b>Changes:</b>
</p>

<ul class="org-ul">
<li>Advertise the need, and check, for the <code>workflow</code> scope for GitHub personal access tokens</li>
<li>Enforce the git remote used to push branches to users' fork to be used instead of the SSH method</li>
<li>Avoid potential previously used tokens with wrong permissions to be used instead of the new one</li>
<li>Add support for the opam 2.5 API</li>
</ul>

<p>
<b>Maintained by</b>: Raja Boujbel (@rjbou, OCamlPro), Kate Deplaix (@kit-ty-kate, Ahrefs)
</p>
</div>
</li>
<li><a id="org8ad97f9"></a>opam-repository Archival: January 1, 2026<br />
<div class="outline-text-5" id="text-org8ad97f9">
<p>
On January 1, 2026, the opam-repository completed its scheduled archival run, removing <b>3,264 package versions</b> (881 unique packages) marked with <code>x-maintenance-intent: archival</code>. This ongoing maintenance process helps keep the repository manageable by removing unmaintained or obsolete package versions.
</p>

<p>
<b>What This Means:</b>
</p>

<ul class="org-ul">
<li>Archived packages are no longer available in the default opam repository</li>
<li>CI systems and lock files may need updates if they depend on archived versions</li>
<li>The archival is based on metadata explicitly set by package maintainers</li>
</ul>

<p>
<b>Background:</b>
</p>

<p>
The archival process was announced by Hannes Mehnert in December 2025 (see the <a href="https://discuss.ocaml.org/t/opam-repository-archival-next-run-scheduled-2026-01-01/17587">Discuss announcement</a>), giving package maintainers and users time to prepare. Packages can be restored from archival by maintainers upon request.
</p>

<p>
This maintenance practice ensures the opam repository remains sustainable and focused on actively maintained packages.
</p>
</div>
</li>
<li><a id="orgb28f722"></a>dune-release<br />
<div class="outline-text-5" id="text-orgb28f722">
<p>
<a href="https://ocaml.org/changelog/dune-release/2026-01-29-dune-release-2.2.0">dune-release 2.2.0</a> (January 29, 2026) brings full compatibility with cmdliner 2.0.0, continuing the ecosystem-wide migration that began with opam 2.5.0's removal of the cmdliner dependency.
</p>

<p>
<b>Why This Matters:</b>
</p>

<p>
cmdliner 2.0.0 introduced stricter requirements that improve CLI reliability but prevent co-installability with cmdliner 1.x. Following opam 2.5.0's lead in removing this conflict, dune-release 2.2.0 updates to use cmdliner 2.0.0 exclusively. This coordinated effort across the platform tools enables users to upgrade without encountering dependency conflicts.
</p>

<p>
<b>Important Changes:</b>
</p>

<ul class="org-ul">
<li><b>Breaking</b>: Following cmdliner 2.0's stricter requirements, prefix-matching for command options is no longer supported</li>
<li>Users must now provide the full wording for all flags (for example, <code>--skip-tests</code> instead of <code>--skip-test</code>)</li>
<li>This change ensures compatibility with cmdliner 2.0.0 and aligns with modern CLI best practices</li>
<li>If you have automation scripts using shortened flags, update them before upgrading</li>
</ul>

<p>
For technical details, see the <a href="https://erratique.ch/software/cmdliner/doc/Cmdliner">cmdliner 2.0.0 documentation</a> and the <a href="https://github.com/tarides/dune-release/pull/512">dune-release PR #512</a>.
</p>

<p>
<b>Maintained by</b>: Tarides
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org9cd85f4" class="outline-4">
<h4 id="org9cd85f4">Editor Tools</h4>
<div class="outline-text-4" id="text-org9cd85f4">
<p>
<b>Roadmap: <a href="https://ocaml.org/tools/platform-roadmap#w19-navigate-code">Edit / (W19) Navigate Code</a></b>
</p>
</div>
<ul class="org-ul">
