2026.03.03.html
<li><a id="org8f87367"></a>OCaml-LSP Server<br />
<div class="outline-text-5" id="text-org8f87367">
<p>
<a href="https://ocaml.org/changelog/2025-12-20-ocaml-lsp-1-25-0">OCaml-LSP 1.25.0</a> (December 20, 2025) introduces support for <code>.mlx</code> files and new custom requests.
</p>

<p>
<b>Features:</b>
</p>

<ul class="org-ul">
<li><b><code>.mlx</code> Support</b>: Added support for <code>.mlx</code> files, including diagnostics, code actions, hover, and formatting via <code>ocamlformat-mlx</code></li>
<li><b>New Custom Requests</b>: Added <code>typeExpression</code>, <code>locate</code>, and <code>phrase</code> requests to the server</li>
<li><b>Code-Lens Configuration</b>: Code-lens for nested <code>let</code> bindings is now configurable</li>
</ul>

<p>
<b>Fixes:</b>
</p>

<ul class="org-ul">
<li>The server now falls back to <code>.merlin</code> configuration if a <code>dune-project</code> file is missing, provided <a href="https://github.com/ocaml/merlin">dot-merlin-reader</a> is installed</li>
<li>Improved precision of timestamps for collected metrics</li>
</ul>
</div>
</li>
<li><a id="orgcb0e04e"></a>Merlin<br />
<div class="outline-text-5" id="text-orgcb0e04e">
<p>
<a href="https://ocaml.org/changelog/2025-12-20-merlin-v5-6-1-504">Merlin 5.6.1-504</a> (December 20, 2025) brings performance optimizations and improved stability.
</p>

<p>
<b>Key Improvements:</b>
</p>

<ul class="org-ul">
<li><b>Smarter Signature Help</b>: Now triggers correctly on unfinished <code>let ... in</code> bindings and no longer appears redundantly on function names</li>
<li><b>More Reliable Completion</b>: Fixed issues with completion for inlined record labels</li>
<li><b>Improved Performance</b>: Optimized buffer indexing and path calculations</li>
<li><b>Bug Fixes</b>: Resolved a bug where the <code>document</code> command concatenated labels and variants incorrectly</li>
</ul>

<p>
<b>OCaml LSP Server maintained by</b>: Ulysse Gérard (@voodoos, Tarides), Xavier Van de Woestyne (@xvw, Tarides), Rudi Grinberg (@rgrinberg, Jane Street)
</p>

<p>
<b>Merlin maintained by</b>: Ulysse Gérard (@voodoos, Tarides), Xavier Van de Woestyne (@xvw, Tarides), Muluh Godson (@PizieDust, Tarides)
</p>
</div>
</li>
<li><a id="orgac7ccb9"></a>OCaml-eglot<br />
<div class="outline-text-5" id="text-orgac7ccb9">
<p>
We have drastically modified the <code>xref</code> backend (allowing navigation from definition to definition) to make it more suitable for OCaml.
</p>

<p>
In addition, we added the ability to annotate the type of an enclosing active_ (used with the <code>ocaml-eglot-type-enclosing</code> command) or simply to type the selection.
</p>

<p>
These updates have been merged into <code>main</code>, making them available via a MELPA update.
</p>

<p>
<b>ocaml-eglot maintained by</b>: Xavier Van de Woestyne (@xvw, Tarides)
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org1d51332" class="outline-4">
<h4 id="org1d51332">Platform Infrastructure</h4>
<div class="outline-text-4" id="text-org1d51332">
</div>
<ul class="org-ul">
<li><a id="org4ec4c4a"></a>OCaml Infrastructure: How the opam-repository Works<br />
<div class="outline-text-5" id="text-org4ec4c4a">
<p>
The <a href="https://ocaml.org/changelog/2025-11-05-how-the-opam-repository-works">November 5, 2025 article on the opam-repository</a> provides an in-depth look at this critical piece of OCaml infrastructure. The opam repository serves as the central package registry for the OCaml ecosystem, hosting over 4,500 packages. It relies on dedicated volunteer maintainers who review every submission.
</p>

<p>
&mdash;
</p>

<p>
As always, we encourage feedback and contributions from the community as we continue to improve the OCaml Platform ecosystem.
</p>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">Announcing the first release of Alice, a radical OCaml build system</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/announcing-the-first-release-of-alice-a-radical-ocaml-build-system/17472/45">https://discuss.ocaml.org/t/announcing-the-first-release-of-alice-a-radical-ocaml-build-system/17472/45</a>
</p>
</div>
<div id="outline-container-org3121242" class="outline-3">
<h3 id="org3121242">Continuing this thread, Steve Sherratt announced</h3>
<div class="outline-text-3" id="text-org3121242">
<p>
Announcing the release of <a href="https://www.alicecaml.org/blog/alice-v0-5-0/">Alice v0.5.0</a> which introduces parallel builds.
</p>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">mnet, a new TCP/IP stack for unikernels in OCaml</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-mnet-a-new-tcp-ip-stack-for-unikernels-in-ocaml/17851/1">https://discuss.ocaml.org/t/ann-mnet-a-new-tcp-ip-stack-for-unikernels-in-ocaml/17851/1</a>
</p>
</div>
<div id="outline-container-org094ec1e" class="outline-3">
<h3 id="org094ec1e">Calascibetta Romain announced</h3>
<div class="outline-text-3" id="text-org094ec1e">
<p>
I am pleased to announce a series of releases for developing unikernels with OCaml 5 and <a href="https://github.com/robur-coop/miou">Miou</a>. After extensive testing, we are now able to offer a new TCP/IPv4 and IPv6 stack in OCaml that aims to replace <a href="https://github.com/mirage/mirage-tcpip">mirage-tcpip</a> and pave the way for direct-style unikernel development. Below is an overview of the libraries we have built to make this possible.
</p>
</div>
<div id="outline-container-orge5ef605" class="outline-4">
<h4 id="orge5ef605">mkernel</h4>
<div class="outline-text-4" id="text-orge5ef605">
<p>
<code>mkernel</code> is a small library that provides the essentials for developing a unikernel targeting <a href="https://github.com/solo5/solo5">Solo5</a> or <a href="https://unikraft.org/">Unikraft</a>. Its purpose is to expose hypercalls (the unikernel equivalent of syscalls) so that your application can interact with network and block devices.
</p>

<p>
We recommend reading the <code>mkernel</code> <a href="https://robur-coop.github.io/mkernel/local/mkernel/Mkernel/index.html">documentation</a> to understand the key concepts behind unikernels (hypercalls, devices, tenders, etc.). The <a href="https://github.com/robur-coop/mkernel/blob/main/slides/retreat.md">slides</a> we presented at the last <a href="https://retreat.mirageos.org/">MirageOS retreat</a> are also helpful for understanding our new workflow. Compiling a unikernel now only requires <code>dune</code> and vendored libraries. We have therefore chosen not to resolve dependencies automatically (as <a href="https://github.com/tarides/opam-monorepo">opam-monorepo</a> did) or to impose them (as the <code>mirage</code> tool does), giving developers full freedom to build their unikernels as they see fit. In particular, this makes it straightforward to use ppx rewriters, which was difficult or impossible with the <code>mirage</code> tool.
</p>
</div>
<ul class="org-ul">
<li><a id="org7dded92"></a>A new workflow and targets<br />
<div class="outline-text-5" id="text-org7dded92">
<p>
This release is experimental: Xen is not yet supported, and Unikraft support is partial. However, both platforms are on our roadmap, so if you are interested in them, please let us know! We are also developing tooling to streamline the workflow, with the guiding principle that these tools should never dictate which dependencies your unikernel uses or which build system you choose.
</p>
</div>
</li>
</ul>
</div>
