2026.03.03.org
*** mnet

~mnet~ is the centerpiece of this release. It is designed to replace (and improve upon) [[https://github.com/mirage/mirage-tcpip][mirage-tcpip]] by offering a direct-style API built on effects. The API deliberately mirrors the ~Unix~ socket interface: ~connect~, ~listen~, ~accept~, ~read~, ~write~, and ~close~ all behave the way you would expect.

Here is a small example of an echo server:
#+begin_src ocaml
let run (ipv4, gateway, ipv6) =
  Mkernel.(run [ rng; Mnet.stack ~name:"service" ?gateway ~ipv6 ipv4 ])
  @@ fun rng (daemon, tcp, udp) ->
  let@ () = fun () -> Mnet.kill daemon in
  let@ () = fun () -> Mirage_crypto_rng_mkernel.kill rng in
  let listen = Mnet.TCP.listen tcp 9000 in
  let flow = Mnet.TCP.accept tcp listen in
  let buf = Bytes.create 4096 in
  let rec echo () =
    let len = Mnet.TCP.read flow buf in
    if len > 0 then begin
      Mnet.TCP.write flow (Bytes.sub_string buf 0 len);
      echo ()
    end
  in
  let@ () = fun () -> Mnet.TCP.close flow in
  echo ()
#+end_src

TLS support (via [[https://github.com/mirleft/ocaml-tls][ocaml-tls]]) is already available, allowing you to establish secure connections with your unikernel. DNS resolution (via [[https://github.com/mirage/ocaml-dns][ocaml-dns]]) and the [[https://github.com/robur-coop/happy-eyeballs][Happy Eyeballs]] algorithm are also included, so that a unikernel can resolve hostnames and connect to remote services over both IPv4 and IPv6.

A [[https://robur-coop.github.io/mnet/][short tutorial]] walks you through creating an echo server as a unikernel, similar to what we [[https://robur-coop.github.io/miou/echo.html][already offer]] for Miou. For the curious, an article about IPv4 and Miou is available [[https://blog.robur.coop/articles/utcp_and_effects.html][here]].

Beyond the move to effects for all scheduling, I would like to give special thanks to:
- Edwin Török for proposing fixes to prevent denial-of-service attacks, which
  have been integrated into ~mnet~ (in particular for [[https://osv.dev/vulnerability/OSEC-2026-02][ARP]]).
- Nicolas Ojeda Bär for contributing an IPv6 implementation that we adopted and
  improved (caches, packet fragmentation and reassembly, etc.)
- Reynir for patiently debugging PCAP traces
- Hannes for sharing his deep knowledge of the TCP protocol and its
  interactions with IPv4 and IPv6

As well as others who participated in the development of ~mnet~ in one way or another.

**** Developing and deploying unikernels

This library also marks a turning point in our approach to unikernels. We no longer treat a regular OCaml application as something that can be transparently turned into a unikernel. Developing a unikernel now means developing a unikernel from the start. In our experience, trying to retrofit an existing application into a unikernel was neither practical nor worthwhile.

Our tutorial therefore covers both the development and deployment of unikernels. On the deployment side, we also recommend exploring [[https://github.com/robur-coop/albatross][Albatross]].

*** utcp

[[https://github.com/robur-coop/utcp][~utcp~]] is a pure OCaml implementation of the TCP protocol, used internally by ~mnet~ to handle TCP connections. The implementation is based on a state machine and performs no I/O itself, making it easy to test and reason about.

~utcp~ covers the full TCP lifecycle: the three-way handshake, reliable in-order data delivery with retransmissions, flow control, congestion control, and connection teardown. It has been tested extensively through our end-to-end unikernel tests (a simple [[https://github.com/robur-coop/mnet/tree/main/unikernels/echo][echo]] server and client, and a [[https://github.com/robur-coop/mnet/tree/main/unikernels/resolver][DNS resolver]]).

**** Unikernels and proofs

~utcp~ also reflects our ambition to incorporate, as time permits, proof-based implementations. Other examples include:
- miou with its priority queue (see the [[https://inria.hal.science/hal-01561094][VOCAL]] project)
- mirage-crypto with certain cryptographic primitives (see the [[https://github.com/mit-plv/fiat-crypto][fiat]] project)
- and now utcp (see [[https://www.cl.cam.ac.uk/~pes20/Netsem/][netsem]])

This effort is still in its early stages, but we welcome improvements and collaborations in this area.

*** mhttp

To reach a wider audience, we also provide an HTTP protocol implementation for unikernels, building on the work we started (and currently use in production) with [[https://github.com/robur-coop/httpcats][httpcats]].

~mhttp~ is essentially a unikernel-oriented counterpart to ~httpcats~, using [[https://github.com/robur-coop/ocaml-h1][ocaml-h1]] and [[https://github.com/anmonteiro/ocaml-h2][ocaml-h2]] as its HTTP/1.1 and H2 backends.

**** Ecosystem and composability

Although ~mhttp~ is a small project, it illustrates a broader principle behind our cooperative's approach to library development. As we have [[https://discuss.ocaml.org/t/on-concurrency-models/15899/13?u=dinosaure][stated before]], everything we build is designed to be reusable with schedulers other than Miou and in contexts other than unikernels. Regardless of which scheduler one prefers, we believe in a pragmatic, cooperative approach to contributing to the community.

Our primary focus remains unikernel development, but years of experience building protocol and format libraries have taught us that keeping them scheduler-agnostic is in everyone's best interest, for maintainability, testability, and reliability alike. Wherever possible, you will find a general-purpose library alongside its unikernel counterpart: ~httpcats~ and ~mhttp~ are one such pair.

