2026.03.03.html
<div id="outline-container-orga286889" class="outline-4">
<h4 id="orga286889">mnet</h4>
<div class="outline-text-4" id="text-orga286889">
<p>
<code>mnet</code> is the centerpiece of this release. It is designed to replace (and improve upon) <a href="https://github.com/mirage/mirage-tcpip">mirage-tcpip</a> by offering a direct-style API built on effects. The API deliberately mirrors the <code>Unix</code> socket interface: <code>connect</code>, <code>listen</code>, <code>accept</code>, <code>read</code>, <code>write</code>, and <code>close</code> all behave the way you would expect.
</p>

<p>
Here is a small example of an echo server:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #242521; font-weight: bold;">let</span> <span style="color: #a7601f;">run</span> (<span style="color: #007a9f;">ipv4</span>, <span style="color: #007a9f;">gateway</span>, <span style="color: #007a9f;">ipv6</span>) =
  <span style="color: #557400; font-weight: bold;">Mkernel.</span>(run [ rng; <span style="color: #557400; font-weight: bold;">Mnet.</span>stack <span style="color: #444fcf; font-weight: bold;">~name</span>:<span style="color: #ca3400;">"service"</span> ?gateway ~ipv6 ipv4 ])
  <span style="color: #9f0d0f;">@@</span> <span style="color: #006f00; font-weight: bold;">fun</span> <span style="color: #007a9f;">rng</span> (<span style="color: #007a9f;">daemon</span>, <span style="color: #007a9f;">tcp</span>, <span style="color: #007a9f;">udp</span>) -&gt;
  <span style="color: #242521; font-weight: bold;">let@</span> () = <span style="color: #006f00; font-weight: bold;">fun</span> () -&gt; <span style="color: #557400; font-weight: bold;">Mnet.</span>kill daemon <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let@</span> () = <span style="color: #006f00; font-weight: bold;">fun</span> () -&gt; <span style="color: #557400; font-weight: bold;">Mirage_crypto_rng_mkernel.</span>kill rng <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">listen</span> = <span style="color: #557400; font-weight: bold;">Mnet.TCP.</span>listen tcp 9000 <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">flow</span> = <span style="color: #557400; font-weight: bold;">Mnet.TCP.</span>accept tcp listen <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">buf</span> = <span style="color: #557400; font-weight: bold;">Bytes.</span>create 4096 <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #242521; font-weight: bold;">rec</span> <span style="color: #a7601f;">echo</span> () =
    <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">len</span> = <span style="color: #557400; font-weight: bold;">Mnet.TCP.</span>read flow buf <span style="color: #242521; font-weight: bold;">in</span>
    <span style="color: #006f00; font-weight: bold;">if</span> len &gt; 0 <span style="color: #006f00; font-weight: bold;">then</span> <span style="color: #242521; font-weight: bold;">begin</span>
      <span style="color: #557400; font-weight: bold;">Mnet.TCP.</span>write flow (<span style="color: #557400; font-weight: bold;">Bytes.</span>sub_string buf 0 len);
      echo ()
    <span style="color: #242521; font-weight: bold;">end</span>
  <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let@</span> () = <span style="color: #006f00; font-weight: bold;">fun</span> () -&gt; <span style="color: #557400; font-weight: bold;">Mnet.TCP.</span>close flow <span style="color: #242521; font-weight: bold;">in</span>
  echo ()
</code></pre>
</div>

<p>
TLS support (via <a href="https://github.com/mirleft/ocaml-tls">ocaml-tls</a>) is already available, allowing you to establish secure connections with your unikernel. DNS resolution (via <a href="https://github.com/mirage/ocaml-dns">ocaml-dns</a>) and the <a href="https://github.com/robur-coop/happy-eyeballs">Happy Eyeballs</a> algorithm are also included, so that a unikernel can resolve hostnames and connect to remote services over both IPv4 and IPv6.
</p>

<p>
A <a href="https://robur-coop.github.io/mnet/">short tutorial</a> walks you through creating an echo server as a unikernel, similar to what we <a href="https://robur-coop.github.io/miou/echo.html">already offer</a> for Miou. For the curious, an article about IPv4 and Miou is available <a href="https://blog.robur.coop/articles/utcp_and_effects.html">here</a>.
</p>

<p>
Beyond the move to effects for all scheduling, I would like to give special thanks to:
</p>
<ul class="org-ul">
<li>Edwin Török for proposing fixes to prevent denial-of-service attacks, which
have been integrated into <code>mnet</code> (in particular for <a href="https://osv.dev/vulnerability/OSEC-2026-02">ARP</a>).</li>
<li>Nicolas Ojeda Bär for contributing an IPv6 implementation that we adopted and
improved (caches, packet fragmentation and reassembly, etc.)</li>
<li>Reynir for patiently debugging PCAP traces</li>
<li>Hannes for sharing his deep knowledge of the TCP protocol and its
interactions with IPv4 and IPv6</li>
</ul>

<p>
As well as others who participated in the development of <code>mnet</code> in one way or another.
</p>
</div>
<ul class="org-ul">
<li><a id="orgcb75139"></a>Developing and deploying unikernels<br />
<div class="outline-text-5" id="text-orgcb75139">
<p>
This library also marks a turning point in our approach to unikernels. We no longer treat a regular OCaml application as something that can be transparently turned into a unikernel. Developing a unikernel now means developing a unikernel from the start. In our experience, trying to retrofit an existing application into a unikernel was neither practical nor worthwhile.
</p>

<p>
Our tutorial therefore covers both the development and deployment of unikernels. On the deployment side, we also recommend exploring <a href="https://github.com/robur-coop/albatross">Albatross</a>.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orga356b60" class="outline-4">
<h4 id="orga356b60">utcp</h4>
<div class="outline-text-4" id="text-orga356b60">
<p>
<a href="https://github.com/robur-coop/utcp"><code>utcp</code></a> is a pure OCaml implementation of the TCP protocol, used internally by <code>mnet</code> to handle TCP connections. The implementation is based on a state machine and performs no I/O itself, making it easy to test and reason about.
</p>

<p>
<code>utcp</code> covers the full TCP lifecycle: the three-way handshake, reliable in-order data delivery with retransmissions, flow control, congestion control, and connection teardown. It has been tested extensively through our end-to-end unikernel tests (a simple <a href="https://github.com/robur-coop/mnet/tree/main/unikernels/echo">echo</a> server and client, and a <a href="https://github.com/robur-coop/mnet/tree/main/unikernels/resolver">DNS resolver</a>).
</p>
</div>
<ul class="org-ul">
<li><a id="orgd0e2bbe"></a>Unikernels and proofs<br />
<div class="outline-text-5" id="text-orgd0e2bbe">
<p>
<code>utcp</code> also reflects our ambition to incorporate, as time permits, proof-based implementations. Other examples include:
</p>
<ul class="org-ul">
<li>miou with its priority queue (see the <a href="https://inria.hal.science/hal-01561094">VOCAL</a> project)</li>
<li>mirage-crypto with certain cryptographic primitives (see the <a href="https://github.com/mit-plv/fiat-crypto">fiat</a> project)</li>
<li>and now utcp (see <a href="https://www.cl.cam.ac.uk/~pes20/Netsem/">netsem</a>)</li>
</ul>

<p>
This effort is still in its early stages, but we welcome improvements and collaborations in this area.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org79c5907" class="outline-4">
<h4 id="org79c5907">mhttp</h4>
<div class="outline-text-4" id="text-org79c5907">
<p>
To reach a wider audience, we also provide an HTTP protocol implementation for unikernels, building on the work we started (and currently use in production) with <a href="https://github.com/robur-coop/httpcats">httpcats</a>.
</p>

<p>
<code>mhttp</code> is essentially a unikernel-oriented counterpart to <code>httpcats</code>, using <a href="https://github.com/robur-coop/ocaml-h1">ocaml-h1</a> and <a href="https://github.com/anmonteiro/ocaml-h2">ocaml-h2</a> as its HTTP/1.1 and H2 backends.
</p>
</div>
<ul class="org-ul">
<li><a id="org3cfe51b"></a>Ecosystem and composability<br />
<div class="outline-text-5" id="text-org3cfe51b">
<p>
Although <code>mhttp</code> is a small project, it illustrates a broader principle behind our cooperative's approach to library development. As we have <a href="https://discuss.ocaml.org/t/on-concurrency-models/15899/13?u=dinosaure">stated before</a>, everything we build is designed to be reusable with schedulers other than Miou and in contexts other than unikernels. Regardless of which scheduler one prefers, we believe in a pragmatic, cooperative approach to contributing to the community.
</p>

<p>
Our primary focus remains unikernel development, but years of experience building protocol and format libraries have taught us that keeping them scheduler-agnostic is in everyone's best interest, for maintainability, testability, and reliability alike. Wherever possible, you will find a general-purpose library alongside its unikernel counterpart: <code>httpcats</code> and <code>mhttp</code> are one such pair.
</p>
</div>
</li>
</ul>
</div>
