2026.03.03.org
*** Vifu

As [[https://discuss.ocaml.org/t/ann-httpcats-ocaml-h1-vif-hurl-a-webstack-for-ocaml-5/17104][previously announced]], we have developed a web framework for OCaml 5 called [[https://github.com/robur-coop/vif][vif]], which we use in production for our [[https://builds.robur.coop][builds.robur.coop]] website (we recommend the [[https://robur-coop.github.io/vif/][tutorial]] presented at [[https://fun-ocaml.com][FUN OCaml]] 2025).

~vif~ now has a unikernel variant: ~vifu~. It offers nearly the same interface as ~vif~ (except for static file management), making it possible to build websites entirely in OCaml. Here is a small unikernel that displays "Hello World!":

#+begin_src ocaml
let hello_world req _server () =
  let open Vifu.Response.Syntax in
  let* () = Vifu.Response.with_text req "Hello World!\n" in
  Vifu.Response.respond `OK

let run (ipv4, gateway, ipv6) =
  Mkernel.(run [ rng; Mnet.stack ~name:"service" ?gateway ~ipv6 ipv4 ])
  @@ fun rng (daemon, tcp, udp) ->
  let@ () = fun () -> Mnet.kill daemon in
  let@ () = fun () -> Mirage_crypto_rng_mkernel.kill rng in
  let cfg = Vifu.Config.v 80 in
  let routes = Vifu.[ get (rel /?? any) --> hello_world ] in
  Vifu.run ~cfg tcp routes ()
#+end_src

*disclaimer*: If you would like to use ~vifu~, please note that although a recent release has been made, one final fix is still needed to compile a unikernel with this library (to avoid pulling in the ~unix~ module). We recommend pinning ~vifu~ for now.

*** Unikernels

Behind all these libraries, there are concrete projects that we would like to share with you:
- Our [[https://github.com/dinosaure/immuable][~immutable~]] unikernel, a web server for static files (which can be generated, for example, with [[https://github.com/xhtmlboi/yocaml][YOCaml]]).
- A DNS resolver unikernel: [[https://github.com/dinosaure/pagejaune][~pagejaune~]]
- A small search engine for emails from an archive such as the caml-list: [[https://github.com/robur-coop/blame][~blame~]]. More details are available [[https://blog.robur.coop/articles/2025-04-12-ptt-search-webapp.html][here]].

*** Conclusion

After several years of work, we are now able to develop unikernels with OCaml 5 in earnest. We hope that our new workflow will be of interest to the community and that these libraries will be a useful contribution to the OCaml ecosystem.

If you would like to try it out, we recommend starting with the [[https://robur-coop.github.io/mnet/][mnet tutorial]] and the [[https://robur-coop.github.io/mkernel/local/mkernel/Mkernel/index.html][mkernel documentation]]. Feel free to open issues or reach out to us if you have any questions!
      



* Experiment: format-line
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ann-experiment-format-line/17854/1

** Emile Trotignon announced


I made this little experiment a while back: https://github.com/ahrefs/format-line

The idea is to provide a complement to ocp-indent to decide which token should be separated by whitespace and which should not. For now it is based only on lexing information, which make the code simple but also does not always provide enough information to have a nice formatting.

An idea of the output can be read here: https://github.com/ahrefs/format-line/blob/master/test/run.t

The project itself is formatted with ocamlformat, and in the there is a diff of what this changes compared to ocamlformat, on the main source file.

I think this approach could be improved by having a hybrid ast-token stream datastructure. Something where you work on a stream of token but you can query the AST context of a given token.

What do you think ?
      



* Caml in the Capital - Registrations Open!
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/ann-caml-in-the-capital-registrations-open/17776/6

** Continuing this thread, Sacha Ayoun announced


And here is the [[https://www.youtube.com/watch?v=6CM9J2C58dg][link to the recording]]!

We'd like to thank our speakers Jeremy and Nick again, as well as the ~30 attendees to the meetup! It was great having you, and we hope to see you again next time :)
      



* Experimental tools for migrating from Lwt to Eio
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/ann-experimental-tools-for-migrating-from-lwt-to-eio/17855/1

