2026.03.03.html
<div id="outline-container-org64c4717" class="outline-4">
<h4 id="org64c4717">Vifu</h4>
<div class="outline-text-4" id="text-org64c4717">
<p>
As <a href="https://discuss.ocaml.org/t/ann-httpcats-ocaml-h1-vif-hurl-a-webstack-for-ocaml-5/17104">previously announced</a>, we have developed a web framework for OCaml 5 called <a href="https://github.com/robur-coop/vif">vif</a>, which we use in production for our <a href="https://builds.robur.coop">builds.robur.coop</a> website (we recommend the <a href="https://robur-coop.github.io/vif/">tutorial</a> presented at <a href="https://fun-ocaml.com">FUN OCaml</a> 2025).
</p>

<p>
<code>vif</code> now has a unikernel variant: <code>vifu</code>. It offers nearly the same interface as <code>vif</code> (except for static file management), making it possible to build websites entirely in OCaml. Here is a small unikernel that displays "Hello World!":
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #242521; font-weight: bold;">let</span> <span style="color: #a7601f;">hello_world</span> <span style="color: #007a9f;">req</span> <span style="color: #007a9f;">_server</span> () =
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #242521; font-weight: bold;">open </span><span style="color: #557400; font-weight: bold;">Vifu.Response.Syntax</span> <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let*</span> () = <span style="color: #557400; font-weight: bold;">Vifu.Response.</span>with_text req <span style="color: #ca3400;">"Hello World!\n"</span> <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #557400; font-weight: bold;">Vifu.Response.</span>respond <span style="color: #242521;">`OK</span>

<span style="color: #242521; font-weight: bold;">let</span> <span style="color: #a7601f;">run</span> (<span style="color: #007a9f;">ipv4</span>, <span style="color: #007a9f;">gateway</span>, <span style="color: #007a9f;">ipv6</span>) =
  <span style="color: #557400; font-weight: bold;">Mkernel.</span>(run [ rng; <span style="color: #557400; font-weight: bold;">Mnet.</span>stack <span style="color: #444fcf; font-weight: bold;">~name</span>:<span style="color: #ca3400;">"service"</span> ?gateway ~ipv6 ipv4 ])
  <span style="color: #9f0d0f;">@@</span> <span style="color: #006f00; font-weight: bold;">fun</span> <span style="color: #007a9f;">rng</span> (<span style="color: #007a9f;">daemon</span>, <span style="color: #007a9f;">tcp</span>, <span style="color: #007a9f;">udp</span>) -&gt;
  <span style="color: #242521; font-weight: bold;">let@</span> () = <span style="color: #006f00; font-weight: bold;">fun</span> () -&gt; <span style="color: #557400; font-weight: bold;">Mnet.</span>kill daemon <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let@</span> () = <span style="color: #006f00; font-weight: bold;">fun</span> () -&gt; <span style="color: #557400; font-weight: bold;">Mirage_crypto_rng_mkernel.</span>kill rng <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">cfg</span> = <span style="color: #557400; font-weight: bold;">Vifu.Config.</span>v 80 <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">routes</span> = <span style="color: #557400; font-weight: bold;">Vifu.</span>[ get (rel /<span style="color: #9f0d0f;">??</span> any) --&gt; hello_world ] <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #557400; font-weight: bold;">Vifu.</span>run ~cfg tcp routes ()
</code></pre>
</div>

<p>
<b>disclaimer</b>: If you would like to use <code>vifu</code>, please note that although a recent release has been made, one final fix is still needed to compile a unikernel with this library (to avoid pulling in the <code>unix</code> module). We recommend pinning <code>vifu</code> for now.
</p>
</div>
</div>
<div id="outline-container-org0e2fa28" class="outline-4">
<h4 id="org0e2fa28">Unikernels</h4>
<div class="outline-text-4" id="text-org0e2fa28">
<p>
Behind all these libraries, there are concrete projects that we would like to share with you:
</p>
<ul class="org-ul">
<li>Our <a href="https://github.com/dinosaure/immuable"><code>immutable</code></a> unikernel, a web server for static files (which can be generated, for example, with <a href="https://github.com/xhtmlboi/yocaml">YOCaml</a>).</li>
<li>A DNS resolver unikernel: <a href="https://github.com/dinosaure/pagejaune"><code>pagejaune</code></a></li>
<li>A small search engine for emails from an archive such as the caml-list: <a href="https://github.com/robur-coop/blame"><code>blame</code></a>. More details are available <a href="https://blog.robur.coop/articles/2025-04-12-ptt-search-webapp.html">here</a>.</li>
</ul>
</div>
</div>
<div id="outline-container-org70bd2e5" class="outline-4">
<h4 id="org70bd2e5">Conclusion</h4>
<div class="outline-text-4" id="text-org70bd2e5">
<p>
After several years of work, we are now able to develop unikernels with OCaml 5 in earnest. We hope that our new workflow will be of interest to the community and that these libraries will be a useful contribution to the OCaml ecosystem.
</p>

<p>
If you would like to try it out, we recommend starting with the <a href="https://robur-coop.github.io/mnet/">mnet tutorial</a> and the <a href="https://robur-coop.github.io/mkernel/local/mkernel/Mkernel/index.html">mkernel documentation</a>. Feel free to open issues or reach out to us if you have any questions!
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="5">Experiment: format-line</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-experiment-format-line/17854/1">https://discuss.ocaml.org/t/ann-experiment-format-line/17854/1</a>
</p>
</div>
<div id="outline-container-org85a5ab3" class="outline-3">
<h3 id="org85a5ab3">Emile Trotignon announced</h3>
<div class="outline-text-3" id="text-org85a5ab3">
<p>
I made this little experiment a while back: <a href="https://github.com/ahrefs/format-line">https://github.com/ahrefs/format-line</a>
</p>

<p>
The idea is to provide a complement to ocp-indent to decide which token should be separated by whitespace and which should not. For now it is based only on lexing information, which make the code simple but also does not always provide enough information to have a nice formatting.
</p>

<p>
An idea of the output can be read here: <a href="https://github.com/ahrefs/format-line/blob/master/test/run.t">https://github.com/ahrefs/format-line/blob/master/test/run.t</a>
</p>

<p>
The project itself is formatted with ocamlformat, and in the there is a diff of what this changes compared to ocamlformat, on the main source file.
</p>

<p>
I think this approach could be improved by having a hybrid ast-token stream datastructure. Something where you work on a stream of token but you can query the AST context of a given token.
</p>

<p>
What do you think ?
</p>
</div>
</div>
</div>
<div id="outline-container-6" class="outline-2">
<h2 id="6">Caml in the Capital - Registrations Open!</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-caml-in-the-capital-registrations-open/17776/6">https://discuss.ocaml.org/t/ann-caml-in-the-capital-registrations-open/17776/6</a>
</p>
</div>
<div id="outline-container-orgf05f5c3" class="outline-3">
<h3 id="orgf05f5c3">Continuing this thread, Sacha Ayoun announced</h3>
<div class="outline-text-3" id="text-orgf05f5c3">
<p>
And here is the <a href="https://www.youtube.com/watch?v=6CM9J2C58dg">link to the recording</a>!
</p>

<p>
We'd like to thank our speakers Jeremy and Nick again, as well as the ~30 attendees to the meetup! It was great having you, and we hope to see you again next time :)
</p>
</div>
</div>
</div>
<div id="outline-container-7" class="outline-2">
<h2 id="7">Experimental tools for migrating from Lwt to Eio</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-experimental-tools-for-migrating-from-lwt-to-eio/17855/1">https://discuss.ocaml.org/t/ann-experimental-tools-for-migrating-from-lwt-to-eio/17855/1</a>
</p>
</div>
