2026.03.03.org
** Jules announced


We developed tools to help us migrate Ocsigen libraries and applications to direct-style concurrency and we are happy to share them.

There are 4 independent tools for different purposes:

- Replacing every uses of ~lwt_ppx~ with ~Lwt~ function calls (e.g. replacing ~let%lwt ... in~ with ~let* ... in~).
  This is purely syntactic and allows you to easily remove a PPX. It handles inserting ~open Lwt.Syntax~ at the top of the file.

- Warning about occurrences of ~let _ = ...~ and ~ignore ...~, which make the next tools less reliable.
  These are called “implicit fork” because code run concurrently if the ignored value is an Lwt thread. This requires an explicit call to ~Fiber.fork~ with Eio.

- Migrating uses of ~Lwt_log~ to ~Logs~.
  It was used on [[https://github.com/ocsigen/ocsigenserver/pull/256][ocsigenserver]] for example.
  At this point we generate code working as before and did not introduce a dependency on Eio.

- Migrating uses of ~Lwt~ to ~Eio~. It rewrites code written in monadic style into direct-style, for example this code:

  #+begin_src ocaml
  let _ =
    let* x = f 1 in
    let+ y = f 2 in
    Lwt.bind (f 3) (fun z ->
      Lwt.return (x + y + z))
  #+end_src

  is rewritten to:

  #+begin_src ocaml
  let _ =
    let x = f 1 in
    let y = f 2 in
    let z = f 3 in
    x + y + z
  #+end_src

  It also rewrite ~Lwt~ function calls to their equivalent in ~Eio~ and handles many IO operations.

  Unfortunately, this tool doesn’t generate fully equivalent code and requires manual modifications. Comments are inserted in many places where intervention is needed.

  An example of generated incorrect code is:

  #+begin_src ocaml
  let _ =
    let a = operation_1 () in
    let* b = operation_2 () in
    let* a = a in
    Lwt.return (a + b)
  #+end_src

  which is rewritten into:

  #+begin_src ocaml
  let _ =
    let a = operation_1 () in
    let b = operation_2 () in
    let a = a in
    a + b
  #+end_src

  This is incorrect because ~operation_1~ and ~operation_2~ are now sequential but were concurrent before. This is a case of an implicit fork that cannot easily be detected. The correct transformation would be:

  #+begin_src ocaml
  let _ =
    let a, b = Eio.Fiber.pair operation_1 operation_2 in
    a + b
  #+end_src

  We could achieve the migration on [[https://github.com/ocsigen/eliom/pull/846][eliom]] and [[https://github.com/ocsigen/ocsigenserver/pull/269][ocsigenserver]]

All the tools use OCamlformat under the hood to generate the code. This has the inconvenient of enforcing the use of OCamlformat before using them as they will reformat the entire codebase.

The last two tools use Merlin under the hood to locate uses of ~Lwt~ functions in the source files. This works by reading Merlin’s ocaml-index files built by Dune to extract the location in the source files that we need.

Currently, it only supports Eio as a backend but can easily be [[https://github.com/tarides/ciao-lwt/blob/main/bin/ciao_lwt/to_direct_style/concurrency_backend.ml][adapted]] to other direct-style concurrency libraries.

This work was made possible thanks to the support of the [[https://nlnet.nl/thema/NGIZeroCore.html][NGI Zero Core fund]] through the [[https://nlnet.nl/][Nlnet foundation]], and is perfomed by [[https://tarides.com/][Tarides]].
      



* First alpha release of OCaml 5.5.0
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://discuss.ocaml.org/t/first-alpha-release-of-ocaml-5-5-0/17856/1

** octachron announced


Four months after the release of OCaml 5.4.0, the set of new features for the future version 5.5.0 of OCaml has been frozen. We are thus happy to announce the first alpha release for OCaml 5.5.0.

This alpha version is here to help fellow hackers join us early in our bug hunting and opam ecosystem fixing fun (see below for the installation instructions). More information about the release process is available at https://github.com/ocaml/ocaml/blob/trunk/release-info/introduction.md.

The progress on stabilising the ecosystem is tracked on the [[https://github.com/ocaml/opam-repository/issues/29463][opam readiness for 5.5.0 meta-issue]] .

There is also a companion alpha opam repository available for this alpha release
#+begin_example
$ opam repo add alpha git+https://github.com/kit-ty-kate/opam-alpha-repository.git
#+end_example
which contains in-progress alpha releases of opam packages that are being updated for
OCaml 5.5.0 .

The full release is expected between May and June. There are more information available in the [[https://github.com/ocaml/ocaml/blob/trunk/release-info/calendar.md][prospective release calendar]].

If you find any bugs, please report them on the [[https://github.com/ocaml/ocaml/issues][OCaml's issue tracker]].

If you are interested in the ongoing list of new features and bug fixes, the
updated [[https://github.com/ocaml/ocaml/blob/5.5/Changes][change log for OCaml 5.5.0 is available on GitHub]].

Happy hacking,
Florian Angeletti for the OCaml team


*** Installation Instructions

The base compiler can be installed as an opam switch with the following commands
on opam 2.1 and later:

    opam update
    opam switch create 5.5.0~alpha1

The source code for the alpha is also available at these addresses:

- GitHub: https://github.com/ocaml/ocaml/archive/5.5.0-alpha1.tar.gz
- OCaml archives at Inria: https://caml.inria.fr/pub/distrib/ocaml-5.5/ocaml-5.5.0~alpha1.tar.gz

