2026.03.03.html
<div id="outline-container-org2db7897" class="outline-3">
<h3 id="org2db7897">Jules announced</h3>
<div class="outline-text-3" id="text-org2db7897">
<p>
We developed tools to help us migrate Ocsigen libraries and applications to direct-style concurrency and we are happy to share them.
</p>

<p>
There are 4 independent tools for different purposes:
</p>

<ul class="org-ul">
<li>Replacing every uses of <code>lwt_ppx</code> with <code>Lwt</code> function calls (e.g. replacing <code>let%lwt ... in</code> with <code>let* ... in</code>).
This is purely syntactic and allows you to easily remove a PPX. It handles inserting <code>open Lwt.Syntax</code> at the top of the file.</li>

<li>Warning about occurrences of <code>let _ = ...</code> and <code>ignore ...</code>, which make the next tools less reliable.
These are called “implicit fork” because code run concurrently if the ignored value is an Lwt thread. This requires an explicit call to <code>Fiber.fork</code> with Eio.</li>

<li>Migrating uses of <code>Lwt_log</code> to <code>Logs</code>.
It was used on <a href="https://github.com/ocsigen/ocsigenserver/pull/256">ocsigenserver</a> for example.
At this point we generate code working as before and did not introduce a dependency on Eio.</li>

<li><p>
Migrating uses of <code>Lwt</code> to <code>Eio</code>. It rewrites code written in monadic style into direct-style, for example this code:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">_</span> =
  <span style="color: #242521; font-weight: bold;">let*</span> <span style="color: #007a9f;">x</span> = f 1 <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let+</span> <span style="color: #007a9f;">y</span> = f 2 <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #557400; font-weight: bold;">Lwt.</span>bind (f 3) (<span style="color: #006f00; font-weight: bold;">fun</span> <span style="color: #007a9f;">z</span> -&gt;
    <span style="color: #557400; font-weight: bold;">Lwt.</span>return (x + y + z))
</code></pre>
</div>

<p>
is rewritten to:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">_</span> =
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">x</span> = f 1 <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">y</span> = f 2 <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">z</span> = f 3 <span style="color: #242521; font-weight: bold;">in</span>
  x + y + z
</code></pre>
</div>

<p>
It also rewrite <code>Lwt</code> function calls to their equivalent in <code>Eio</code> and handles many IO operations.
</p>

<p>
Unfortunately, this tool doesn’t generate fully equivalent code and requires manual modifications. Comments are inserted in many places where intervention is needed.
</p>

<p>
An example of generated incorrect code is:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">_</span> =
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">a</span> = operation_1 () <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let*</span> <span style="color: #007a9f;">b</span> = operation_2 () <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let*</span> <span style="color: #007a9f;">a</span> = a <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #557400; font-weight: bold;">Lwt.</span>return (a + b)
</code></pre>
</div>

<p>
which is rewritten into:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">_</span> =
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">a</span> = operation_1 () <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">b</span> = operation_2 () <span style="color: #242521; font-weight: bold;">in</span>
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">a</span> = a <span style="color: #242521; font-weight: bold;">in</span>
  a + b
</code></pre>
</div>

<p>
This is incorrect because <code>operation_1</code> and <code>operation_2</code> are now sequential but were concurrent before. This is a case of an implicit fork that cannot easily be detected. The correct transformation would be:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">_</span> =
  <span style="color: #242521; font-weight: bold;">let</span> <span style="color: #007a9f;">a</span>, <span style="color: #007a9f;">b</span> = <span style="color: #557400; font-weight: bold;">Eio.Fiber.</span>pair operation_1 operation_2 <span style="color: #242521; font-weight: bold;">in</span>
  a + b
</code></pre>
</div>

<p>
We could achieve the migration on <a href="https://github.com/ocsigen/eliom/pull/846">eliom</a> and <a href="https://github.com/ocsigen/ocsigenserver/pull/269">ocsigenserver</a>
</p></li>
</ul>

<p>
All the tools use OCamlformat under the hood to generate the code. This has the inconvenient of enforcing the use of OCamlformat before using them as they will reformat the entire codebase.
</p>

<p>
The last two tools use Merlin under the hood to locate uses of <code>Lwt</code> functions in the source files. This works by reading Merlin’s ocaml-index files built by Dune to extract the location in the source files that we need.
</p>

<p>
Currently, it only supports Eio as a backend but can easily be <a href="https://github.com/tarides/ciao-lwt/blob/main/bin/ciao_lwt/to_direct_style/concurrency_backend.ml">adapted</a> to other direct-style concurrency libraries.
</p>

<p>
This work was made possible thanks to the support of the <a href="https://nlnet.nl/thema/NGIZeroCore.html">NGI Zero Core fund</a> through the <a href="https://nlnet.nl/">Nlnet foundation</a>, and is perfomed by <a href="https://tarides.com/">Tarides</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-8" class="outline-2">
<h2 id="8">First alpha release of OCaml 5.5.0</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/first-alpha-release-of-ocaml-5-5-0/17856/1">https://discuss.ocaml.org/t/first-alpha-release-of-ocaml-5-5-0/17856/1</a>
</p>
</div>
<div id="outline-container-orgedab093" class="outline-3">
<h3 id="orgedab093">octachron announced</h3>
<div class="outline-text-3" id="text-orgedab093">
<p>
Four months after the release of OCaml 5.4.0, the set of new features for the future version 5.5.0 of OCaml has been frozen. We are thus happy to announce the first alpha release for OCaml 5.5.0.
</p>

<p>
This alpha version is here to help fellow hackers join us early in our bug hunting and opam ecosystem fixing fun (see below for the installation instructions). More information about the release process is available at <a href="https://github.com/ocaml/ocaml/blob/trunk/release-info/introduction.md">https://github.com/ocaml/ocaml/blob/trunk/release-info/introduction.md</a>.
</p>

<p>
The progress on stabilising the ecosystem is tracked on the <a href="https://github.com/ocaml/opam-repository/issues/29463">opam readiness for 5.5.0 meta-issue</a> .
</p>

<p>
There is also a companion alpha opam repository available for this alpha release
</p>
<pre class="example" id="orgeb00e46">
$ opam repo add alpha git+https://github.com/kit-ty-kate/opam-alpha-repository.git
</pre>
<p>
which contains in-progress alpha releases of opam packages that are being updated for
OCaml 5.5.0 .
</p>

<p>
The full release is expected between May and June. There are more information available in the <a href="https://github.com/ocaml/ocaml/blob/trunk/release-info/calendar.md">prospective release calendar</a>.
</p>

<p>
If you find any bugs, please report them on the <a href="https://github.com/ocaml/ocaml/issues">OCaml's issue tracker</a>.
</p>

<p>
If you are interested in the ongoing list of new features and bug fixes, the
updated <a href="https://github.com/ocaml/ocaml/blob/5.5/Changes">change log for OCaml 5.5.0 is available on GitHub</a>.
</p>

<p>
Happy hacking,
Florian Angeletti for the OCaml team
</p>
</div>
<div id="outline-container-orge1459dd" class="outline-4">
<h4 id="orge1459dd">Installation Instructions</h4>
<div class="outline-text-4" id="text-orge1459dd">
<p>
The base compiler can be installed as an opam switch with the following commands
on opam 2.1 and later:
</p>

<p>
opam update
opam switch create 5.5.0~alpha1
</p>

<p>
The source code for the alpha is also available at these addresses:
</p>

<ul class="org-ul">
<li>GitHub: <a href="https://github.com/ocaml/ocaml/archive/5.5.0-alpha1.tar.gz">https://github.com/ocaml/ocaml/archive/5.5.0-alpha1.tar.gz</a></li>
<li>OCaml archives at Inria: <a href="https://caml.inria.fr/pub/distrib/ocaml-5.5/ocaml-5.5.0~alpha1.tar.gz">https://caml.inria.fr/pub/distrib/ocaml-5.5/ocaml-5.5.0~alpha1.tar.gz</a></li>
</ul>
</div>
</div>
