2026.03.03.org
*** Fine-Tuned Compiler Configuration

If you want to tweak the configuration of the compiler, you can switch to the option variant with:

#+begin_example
    opam update
    opam switch create <switch_name> ocaml-variants.5.5.0~alpha1+options <option_list>
#+end_example

where ~option_list~ is a space separated list of ~ocaml-option-*~ packages. For instance, for a flambda and no-flat-float-array switch:
#+begin_example
    opam switch create 5.5.0~alpha1+flambda+nffa ocaml-variants.5.5.0~alpha1+options ocaml-option-flambda ocaml-option-no-flat-float-array
#+end_example

All available options can be listed with ~opam search ocaml-option~.
      



* NotInriaCaml_Std.Wenv@0.1.0 - create Windows envs on macOS [dk0]
:PROPERTIES:
:CUSTOM_ID: 9
:END:
Archive: https://discuss.ocaml.org/t/ann-notinriacaml-std-wenv-0-1-0-create-windows-envs-on-macos-dk0/17858/1

** jbeckford announced


It is my pleasure to announce the following package for [[https://discuss.ocaml.org/t/ann-the-dk0-build-system/17709][the dk0 build system]] that creates a Windows environment ("wenv") using a custom Wine build for macOS:

- [[https://github.com/diskuv/dk/blob/a29e9da3f30df41fa3cfc855b323fdcda6a106c2/etc/dk/v/NotInriaCaml_Std/Wenv.values.lua][NotInriaCaml_Std.Wenv@0.1.0]]

Here is a sample session:

#+begin_example
# Simplest way to install dk0 today. Use ~git pull~ if exists already. 
$ git clone --branch V2_5 https://github.com/diskuv/dk.git dksrc

# Clear out data, cache and intermediate files from any prior
# experiments (from the "--trial" option seen in [ANN] posts)
$ rm -rf t/

# With the default Lua rules ("-I dksrc/etc/dk/v"), run the
# OCaml Windows environment creation rule ("run
# NotInriaCaml_Std.Wenv.Create@0.1.0"). Tell the rule to create the
# wenv at target/my-wenv/ ("dir=...") and make a mount
# ("mount[]=...") inside the wenv where the Unix directory $PWD is
# mapped to Windows M:\project. Depending on Internet, expect 3-4
# minutes for a single-threaded download of artifacts (581MB).
$ dksrc/dk0 --trial -I dksrc/etc/dk/v \
    run NotInriaCaml_Std.Wenv.Create@0.1.0 \
    dir=$PWD/target/my-wenv \
    "mount[]=type=bind,src=$PWD,dst=M:/project"
#+end_example

#+begin_example
# Then enter the wenv by running Command Prompt ("cmd.exe"). Turn
# off Wine debug messages ("WINEDEBUG=-all"). Remember that
# Ctrl-Z is the Windows equivalent of Ctrl-D (EOF) in Unix.
$ WINEDEBUG=-all target/my-wenv/bin/enter cmd.exe

Microsoft Windows 10.0.19045
Z:\> ocamlopt -config
Z:\> gcc --version
Z:\> dir M:
02/27/2026 10:24 AM <DIR> project
Z:\> ocaml
OCaml version 5.4.1

Enter #help;; for help.

# 1+1 ;;
- : int = 2

# ^Z

Z:\> echo let () = print_endline "abcxyz" > letters.ml
Z:\> ocamlopt -o letters.exe letters.ml
Z:\> .\letters.exe
abcxyz
Z:\> exit
#+end_example

Details:

- MinGW with UCRT Windows API and LLVM toolchain (llvm-mingw) for Wine on the host (macOS). X11 has been disabled.
- MinGW with MSVCRT Windows API and GNU compiler and BusyBox binaries (w64devkit) inside Windows guest.
- Wine has good support for programs that use Windows conventions (MSVC, Windows API rather than ~syscall~, etc). But there are important programs that won't work correctly today: MSYS2/Cygwin, Rust uutils.

Enjoy! --jonah
      



* Running Real Docker Containers in OCaml Tests
:PROPERTIES:
:CUSTOM_ID: 10
:END:
Archive: https://discuss.ocaml.org/t/ann-running-real-docker-containers-in-ocaml-tests/17859/1

** Sachin announced


Hi everyone,

I’ve been working on a project called *[[https://github.com/benodiwal/testcontainers-ocaml][testcontainers-ocaml]]*, which brings Testcontainers style integration testing to OCaml.

The idea is simple:

#+begin_quote
Instead of mocking infrastructure (Postgres, Redis, Kafka, etc.), start real Docker containers inside your test suite and tear them down automatically.
#+end_quote

---

*** Why?

In many OCaml projects, integration tests either:

- Rely on mocks

- Depend on globally running services

- Or are skipped entirely in CI

Mocks are useful, but they don’t catch issues like:

- Schema mismatches

- Connection pool behavior

- Real networking failures

- Startup timing problems

- Migration issues

Spinning up disposable containers per test gives us:

- Isolated test environments

- No shared global state

- CI reproducibility

- Real infrastructure behavior

*** Current Status

The project is currently incubating under the Docker organization.

I’m still actively shaping the API and would really appreciate feedback from the OCaml community on:

- API ergonomics

- Prebuilt modules (Postgres, Redis, etc.)

- Testing best practices in OCaml

If anyone here has experience with integration testing patterns in OCaml, I’d love to hear thoughts.

Thanks!
      



* I wrote a DSL for AI personalities in OCaml
:PROPERTIES:
:CUSTOM_ID: 11
:END:
Archive: https://discuss.ocaml.org/t/i-wrote-a-dsl-for-ai-personalities-in-ocaml/17860/1

** Griffin announced


Hi guys,

https://github.com/GriffinCanCode/Callosum

https://pypi.org/project/callosum-dsl/

I wanted a more deterministic way to create personalities for my AI agents that was consistent in production. The interesting catch being that the compiler had to output a prompt, and it needed to be accessible for agents in Python. The solution was this DSL, a format for writing deterministic categories (similar to YAML) that compile to a prompt injectable into Langchain agents. OCaml was the natural choice due to its performance and proven capabilities to host compilers (Rust obv). Looking for beta testers and any feedback is welcome!
      



* Outreachy May 2026
:PROPERTIES:
:CUSTOM_ID: 12
:END:
Archive: https://discuss.ocaml.org/t/outreachy-may-2026/17863/1

** Patrick Ferris announced


Hello everyone,

The OCaml community has signed up to Outreachy May 2026 (see [[https://discuss.ocaml.org/t/outreachy-december-2024-round][past]] [[https://discuss.ocaml.org/t/outreachy-june-2025][posts]])!

#+begin_quote
*What is Outreachy?*

Outreachy is a paid, remote internship program. Outreachy promotes diversity in open source and open science. Our internships are for people who face under-representation, and discrimination or systemic bias in the technology industry of their country.
#+end_quote

The current round is still ongoing with interns making great progress with @tmattio on [[https://raven-ml.dev/][Raven]], with @xvw on [[https://yocaml.github.io/doc/yocaml/index.html][YOCaml]] and with myself on [[https://github.com/geocaml/ocaml-tiff/][ocaml-tiff]].

