2026.03.03.html
<div id="outline-container-org590e3c7" class="outline-4">
<h4 id="org590e3c7">Fine-Tuned Compiler Configuration</h4>
<div class="outline-text-4" id="text-org590e3c7">
<p>
If you want to tweak the configuration of the compiler, you can switch to the option variant with:
</p>

<pre class="example" id="orge962fb0">
opam update
opam switch create &lt;switch_name&gt; ocaml-variants.5.5.0~alpha1+options &lt;option_list&gt;
</pre>

<p>
where <code>option_list</code> is a space separated list of <code>ocaml-option-*</code> packages. For instance, for a flambda and no-flat-float-array switch:
</p>
<pre class="example" id="orgdcbff58">
opam switch create 5.5.0~alpha1+flambda+nffa ocaml-variants.5.5.0~alpha1+options ocaml-option-flambda ocaml-option-no-flat-float-array
</pre>

<p>
All available options can be listed with <code>opam search ocaml-option</code>.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-9" class="outline-2">
<h2 id="9">NotInriaCaml_Std.Wenv@0.1.0 - create Windows envs on macOS [dk0]</h2>
<div class="outline-text-2" id="text-9">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-notinriacaml-std-wenv-0-1-0-create-windows-envs-on-macos-dk0/17858/1">https://discuss.ocaml.org/t/ann-notinriacaml-std-wenv-0-1-0-create-windows-envs-on-macos-dk0/17858/1</a>
</p>
</div>
<div id="outline-container-org72eb05b" class="outline-3">
<h3 id="org72eb05b">jbeckford announced</h3>
<div class="outline-text-3" id="text-org72eb05b">
<p>
It is my pleasure to announce the following package for <a href="https://discuss.ocaml.org/t/ann-the-dk0-build-system/17709">the dk0 build system</a> that creates a Windows environment ("wenv") using a custom Wine build for macOS:
</p>

<ul class="org-ul">
<li><a href="https://github.com/diskuv/dk/blob/a29e9da3f30df41fa3cfc855b323fdcda6a106c2/etc/dk/v/NotInriaCaml_Std/Wenv.values.lua">NotInriaCaml_Std.Wenv@0.1.0</a></li>
</ul>

<p>
Here is a sample session:
</p>

<pre class="example" id="orgbc33cba">
# Simplest way to install dk0 today. Use ~git pull~ if exists already. 
$ git clone --branch V2_5 https://github.com/diskuv/dk.git dksrc

# Clear out data, cache and intermediate files from any prior
# experiments (from the "--trial" option seen in [ANN] posts)
$ rm -rf t/

# With the default Lua rules ("-I dksrc/etc/dk/v"), run the
# OCaml Windows environment creation rule ("run
# NotInriaCaml_Std.Wenv.Create@0.1.0"). Tell the rule to create the
# wenv at target/my-wenv/ ("dir=...") and make a mount
# ("mount[]=...") inside the wenv where the Unix directory $PWD is
# mapped to Windows M:\project. Depending on Internet, expect 3-4
# minutes for a single-threaded download of artifacts (581MB).
$ dksrc/dk0 --trial -I dksrc/etc/dk/v \
    run NotInriaCaml_Std.Wenv.Create@0.1.0 \
    dir=$PWD/target/my-wenv \
    "mount[]=type=bind,src=$PWD,dst=M:/project"
</pre>

<pre class="example" id="orgf7b8f96">
# Then enter the wenv by running Command Prompt ("cmd.exe"). Turn
# off Wine debug messages ("WINEDEBUG=-all"). Remember that
# Ctrl-Z is the Windows equivalent of Ctrl-D (EOF) in Unix.
$ WINEDEBUG=-all target/my-wenv/bin/enter cmd.exe

Microsoft Windows 10.0.19045
Z:\&gt; ocamlopt -config
Z:\&gt; gcc --version
Z:\&gt; dir M:
02/27/2026 10:24 AM &lt;DIR&gt; project
Z:\&gt; ocaml
OCaml version 5.4.1

Enter #help;; for help.

# 1+1 ;;
- : int = 2

# ^Z

Z:\&gt; echo let () = print_endline "abcxyz" &gt; letters.ml
Z:\&gt; ocamlopt -o letters.exe letters.ml
Z:\&gt; .\letters.exe
abcxyz
Z:\&gt; exit
</pre>

<p>
Details:
</p>

<ul class="org-ul">
<li>MinGW with UCRT Windows API and LLVM toolchain (llvm-mingw) for Wine on the host (macOS). X11 has been disabled.</li>
<li>MinGW with MSVCRT Windows API and GNU compiler and BusyBox binaries (w64devkit) inside Windows guest.</li>
<li>Wine has good support for programs that use Windows conventions (MSVC, Windows API rather than <code>syscall</code>, etc). But there are important programs that won't work correctly today: MSYS2/Cygwin, Rust uutils.</li>
</ul>

<p>
Enjoy! &ndash;jonah
</p>
</div>
</div>
</div>
<div id="outline-container-10" class="outline-2">
<h2 id="10">Running Real Docker Containers in OCaml Tests</h2>
<div class="outline-text-2" id="text-10">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-running-real-docker-containers-in-ocaml-tests/17859/1">https://discuss.ocaml.org/t/ann-running-real-docker-containers-in-ocaml-tests/17859/1</a>
</p>
</div>
<div id="outline-container-orgc702b87" class="outline-3">
<h3 id="orgc702b87">Sachin announced</h3>
<div class="outline-text-3" id="text-orgc702b87">
<p>
Hi everyone,
</p>

<p>
I’ve been working on a project called <b><a href="https://github.com/benodiwal/testcontainers-ocaml">testcontainers-ocaml</a></b>, which brings Testcontainers style integration testing to OCaml.
</p>

<p>
The idea is simple:
</p>

<blockquote>
<p>
Instead of mocking infrastructure (Postgres, Redis, Kafka, etc.), start real Docker containers inside your test suite and tear them down automatically.
</p>
</blockquote>

<p>
&mdash;
</p>
</div>
<div id="outline-container-orgbe2201f" class="outline-4">
<h4 id="orgbe2201f">Why?</h4>
<div class="outline-text-4" id="text-orgbe2201f">
<p>
In many OCaml projects, integration tests either:
</p>

<ul class="org-ul">
<li>Rely on mocks</li>

<li>Depend on globally running services</li>

<li>Or are skipped entirely in CI</li>
</ul>

<p>
Mocks are useful, but they don’t catch issues like:
</p>

<ul class="org-ul">
<li>Schema mismatches</li>

<li>Connection pool behavior</li>

<li>Real networking failures</li>

<li>Startup timing problems</li>

<li>Migration issues</li>
</ul>

<p>
Spinning up disposable containers per test gives us:
</p>

<ul class="org-ul">
<li>Isolated test environments</li>

<li>No shared global state</li>

<li>CI reproducibility</li>

<li>Real infrastructure behavior</li>
</ul>
</div>
</div>
<div id="outline-container-orge3c2bba" class="outline-4">
<h4 id="orge3c2bba">Current Status</h4>
<div class="outline-text-4" id="text-orge3c2bba">
<p>
The project is currently incubating under the Docker organization.
</p>

<p>
I’m still actively shaping the API and would really appreciate feedback from the OCaml community on:
</p>

<ul class="org-ul">
<li>API ergonomics</li>

<li>Prebuilt modules (Postgres, Redis, etc.)</li>

<li>Testing best practices in OCaml</li>
</ul>

<p>
If anyone here has experience with integration testing patterns in OCaml, I’d love to hear thoughts.
</p>

<p>
Thanks!
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-11" class="outline-2">
<h2 id="11">I wrote a DSL for AI personalities in OCaml</h2>
<div class="outline-text-2" id="text-11">
<p>
Archive: <a href="https://discuss.ocaml.org/t/i-wrote-a-dsl-for-ai-personalities-in-ocaml/17860/1">https://discuss.ocaml.org/t/i-wrote-a-dsl-for-ai-personalities-in-ocaml/17860/1</a>
</p>
</div>
<div id="outline-container-org7be2e9c" class="outline-3">
<h3 id="org7be2e9c">Griffin announced</h3>
<div class="outline-text-3" id="text-org7be2e9c">
<p>
Hi guys,
</p>

<p>
<a href="https://github.com/GriffinCanCode/Callosum">https://github.com/GriffinCanCode/Callosum</a>
</p>

<p>
<a href="https://pypi.org/project/callosum-dsl/">https://pypi.org/project/callosum-dsl/</a>
</p>

<p>
I wanted a more deterministic way to create personalities for my AI agents that was consistent in production. The interesting catch being that the compiler had to output a prompt, and it needed to be accessible for agents in Python. The solution was this DSL, a format for writing deterministic categories (similar to YAML) that compile to a prompt injectable into Langchain agents. OCaml was the natural choice due to its performance and proven capabilities to host compilers (Rust obv). Looking for beta testers and any feedback is welcome!
</p>
</div>
</div>
</div>
<div id="outline-container-12" class="outline-2">
<h2 id="12">Outreachy May 2026</h2>
<div class="outline-text-2" id="text-12">
<p>
Archive: <a href="https://discuss.ocaml.org/t/outreachy-may-2026/17863/1">https://discuss.ocaml.org/t/outreachy-may-2026/17863/1</a>
</p>
</div>
<div id="outline-container-org561947a" class="outline-3">
<h3 id="org561947a">Patrick Ferris announced</h3>
<div class="outline-text-3" id="text-org561947a">
<p>
Hello everyone,
</p>

<p>
The OCaml community has signed up to Outreachy May 2026 (see <a href="https://discuss.ocaml.org/t/outreachy-december-2024-round">past</a> <a href="https://discuss.ocaml.org/t/outreachy-june-2025">posts</a>)!
</p>

<blockquote>
<p>
<b>What is Outreachy?</b>
</p>

<p>
Outreachy is a paid, remote internship program. Outreachy promotes diversity in open source and open science. Our internships are for people who face under-representation, and discrimination or systemic bias in the technology industry of their country.
</p>
</blockquote>

<p>
The current round is still ongoing with interns making great progress with @tmattio on <a href="https://raven-ml.dev/">Raven</a>, with @xvw on <a href="https://yocaml.github.io/doc/yocaml/index.html">YOCaml</a> and with myself on <a href="https://github.com/geocaml/ocaml-tiff/">ocaml-tiff</a>.
</p>
</div>
