2026.03.03.org
*** Important Dates

For this next round, the important dates are as follows (these are always subject to some change):

- Mar 1 - Community sign up deadline :white_check_mark:
- Mar 14 - [[https://www.outreachy.org/communities/cfp/ocaml/][Mentor Signup]]
- Mar 17 to Apr 15 - Contribution period
- May 18 to Aug 17 - Internship period

*Our next deadline is for mentors to sign up to the OCaml community* with a project idea. Please do consider being an Outreachy mentor. If you have any questions or ideas you can always reach out to me directly. If you need a refresher of past projects, there’s a dedicated page on the OCaml website: [[https://ocaml.org/outreachy][OCaml Outreachy Internships]]. Feel free to discuss ideas on this thread too! 

The OCaml community is currently able to financially support Outreachy internships thanks to the generous support of [[https://tarides.com][Tarides]] and [[https://www.janestreet.com][Janestreet]]. This includes being able to fund mentors as well.

Thanks! :camel:
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe to the [[https://sympa.inria.fr/sympa/info/caml-list][caml-list]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
