2026.03.03.html
<div id="outline-container-org4bb99bc" class="outline-4">
<h4 id="org4bb99bc">Important Dates</h4>
<div class="outline-text-4" id="text-org4bb99bc">
<p>
For this next round, the important dates are as follows (these are always subject to some change):
</p>

<ul class="org-ul">
<li>Mar 1 - Community sign up deadline :white_check_mark:</li>
<li>Mar 14 - <a href="https://www.outreachy.org/communities/cfp/ocaml/">Mentor Signup</a></li>
<li>Mar 17 to Apr 15 - Contribution period</li>
<li>May 18 to Aug 17 - Internship period</li>
</ul>

<p>
<b>Our next deadline is for mentors to sign up to the OCaml community</b> with a project idea. Please do consider being an Outreachy mentor. If you have any questions or ideas you can always reach out to me directly. If you need a refresher of past projects, there’s a dedicated page on the OCaml website: <a href="https://ocaml.org/outreachy">OCaml Outreachy Internships</a>. Feel free to discuss ideas on this thread too! 
</p>

<p>
The OCaml community is currently able to financially support Outreachy internships thanks to the generous support of <a href="https://tarides.com">Tarides</a> and <a href="https://www.janestreet.com">Janestreet</a>. This includes being able to fund mentors as well.
</p>

<p>
Thanks! :camel:
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org2b2f5f1" class="outline-2">
<h2 id="org2b2f5f1">Old CWN</h2>
<div class="outline-text-2" id="text-org2b2f5f1">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="orgb603ad7">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
